app/controllers/api/v1/file_uploads_controller.rb

INSERT INTO "uploaded_files" ("file", "created_at", "updated_at") VALUES (?, ?, ?)  [["file", "test.txt"], ["created_at", "2024-01-08 14:00:28.972012"], ["updated_at", "2024-01-08 14:00:28.972012"]]
---
      def create
        uploaded_file = UploadedFile.new(file: params[:file])

        if uploaded_file.save